## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: gcp/prod
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place

Terraform will perform the following actions:

  # helm_release.argocd will be created
+   resource "helm_release" "argocd" {
+       atomic                     = false
+       chart                      = "argo-cd"
+       cleanup_on_fail            = true
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = true
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "argocd"
+       namespace                  = "argocd"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://argoproj.github.io/argo-helm"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       values                     = [
+           (sensitive),
+           <<-EOT
                "server":
                  "rbacConfig":
                    "policy.csv": |
                      g, autotune@contrasting.org, role:admin
                    "policy.default": "readOnly"
                    "scopes": "[email]"
            EOT,
        ]
+       verify                     = false
+       version                    = "5.1.0"
+       wait                       = true
+       wait_for_jobs              = false

+       set {
+           name  = "server.extraArgs"
+           value = "{--insecure}"
        }
    }

  # helm_release.istio-base will be created
+   resource "helm_release" "istio-base" {
+       atomic                     = false
+       chart                      = "base"
+       cleanup_on_fail            = true
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = true
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "istio-base"
+       namespace                  = "istio-system"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://istio-release.storage.googleapis.com/charts"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       verify                     = false
+       version                    = "1.15.2"
+       wait                       = true
+       wait_for_jobs              = false
    }

  # helm_release.istio-egress will be created
+   resource "helm_release" "istio-egress" {
+       atomic                     = false
+       chart                      = "gateway"
+       cleanup_on_fail            = true
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = true
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "istio-egressgateway"
+       namespace                  = "istio-system"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://istio-release.storage.googleapis.com/charts"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       verify                     = false
+       version                    = "1.15.2"
+       wait                       = true
+       wait_for_jobs              = false

+       set {
+           name  = "service.type"
+           value = "ClusterIP"
        }
    }

  # helm_release.istio-ingress will be created
+   resource "helm_release" "istio-ingress" {
+       atomic                     = false
+       chart                      = "gateway"
+       cleanup_on_fail            = true
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = true
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "istio-ingressgateway"
+       namespace                  = "istio-system"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://istio-release.storage.googleapis.com/charts"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       verify                     = false
+       version                    = "1.15.2"
+       wait                       = true
+       wait_for_jobs              = false
    }

  # helm_release.istiod will be created
+   resource "helm_release" "istiod" {
+       atomic                     = false
+       chart                      = "istiod"
+       cleanup_on_fail            = true
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = true
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "istiod"
+       namespace                  = "istio-system"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://istio-release.storage.googleapis.com/charts"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       verify                     = false
+       version                    = "1.15.2"
+       wait                       = true
+       wait_for_jobs              = false

+       set {
+           name  = "grafana.enabled"
+           value = "true"
        }
+       set {
+           name  = "kiali.enabled"
+           value = "true"
        }
+       set {
+           name  = "meshConfig.accessLogFile"
+           value = "/dev/stdout"
        }
+       set {
+           name  = "servicegraph.enabled"
+           value = "true"
        }
+       set {
+           name  = "tracing.enabled"
+           value = "true"
        }
    }

  # kubernetes_annotations.cinema will be updated in-place
!   resource "kubernetes_annotations" "cinema" {
!       annotations = {
+           "mesh.cloud.google.com/proxy" = jsonencode(
                {
+                   managed = "true"
                }
            )
        }
        id          = "apiVersion=v1,kind=Namespace,name=cinema"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # kubernetes_namespace.argocd will be created
+   resource "kubernetes_namespace" "argocd" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

Plan: 6 to add, 1 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:gcp/prod workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 248.11 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| gcp/prod | default | 0.00 | 248.11 | 248.11|
| | **Total** | **0.00** | **248.11** | **248.11** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
